import pyrogram

START_TEXT_MSG = '🤖 مرحبا المستخدم!\n\n📩 يمكنني تنزيل الأغاني من أجلك. فقط أرسل لي اسم الأغنية بالصيغة أدناه:\n\n*/song*  _اسم الاغنية_  او\n*/song*  _اسم موسيقي - اسم الاغنية_\n\nلتنزيل بعض الأغاني. 🎶\n\n**■ المساعدات**💡[ »المطور](https://t.me/G5_F1) \n                          [»قناة البوت](https://t.me/Big1_Bang1)\n                          [»للمساعدة](https://t.me/G5_F1)\n                          [»Give feedback](https://t.me/Big1_Bang1)'

CONFIRMATION_TEXT_MSG = "✅ تم تحميل الاغنية بنجاح!\n\n**■ المساعدات**💡[ »المطور](https://t.me/G5_F1) \n                          [»قناة البوت](https://t.me/Big1_Bang1)\n                          [»للمساعدة](https://t.me/G5_F1)\n                          [»Give feedback](https://t.me/Big1_Bang1)"

SPOTIFY_INPUT_ERROR_TEXT_MSG = '‼️ *أُووبس! لا يدعم الروبوت روابط سبوتيفاي!*\nاعد المحاولة: "*/song* _اسم الاغنية_"\nor: "*/song* _اسم الموسيقي - اسم الاغنية_"\n\n**■ المساعدات**💡[ »المطور](https://t.me/G5_F1) \n                          [»قناة البوت](https://t.me/Big1_Bang1)\n                          [»للمساعدة](https://t.me/G5_F1)\n                          [»Give feedback](https://t.me/Big1_Bang1)'

INVALID_COMMAND_ERROR_TEXT_MSG = '‼️ *أُووبس! أمر خاطئ‌‌!*\nاعد المحاولة: "*/song* _اسم الاغنية_"\nاو: "*/song* _اسم الموسيقي - اسم الاغنية_"\n\n**■ المساعدات**💡[ »المطور](https://t.me/G5_F1)) \n                          [»قناة البوت](https://t.me/Big1_Bang1)\n                          [»للمساعدة](https://t.me/G5_F1)\n                          [»Give feedback](https://t.me/Big1_Bang1)'

TOO_LONG_ERROR_TEXT_MSG = '‼️ *Oops! Video too long to convert!*\nOrder something 30 minutes or less.\n\n**■ المساعدات**💡[ »المطور](https://t.me/G5_F1)) \n                          [»قناة البوت](https://t.me/Big1_Bang1)\n                          [»للمساعدة](https://t.me/G5_F1)\n                          [»Give feedback](https://t.me/Big1_Bang1)'


